In [25]:
import pandas as pd
df = pd.read_csv('F:/Education/DS_Roadmap/ml/14_naive_bayes/titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [26]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked' ], axis='columns', inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [27]:
target = df.Survived
input = df.drop('Survived', axis='columns')

In [28]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [29]:
input.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [30]:
dummies = pd.get_dummies(input.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [31]:
input = pd.concat([input, dummies], axis='columns')
input.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [32]:
input.drop('Sex', axis='columns', inplace=True)
input.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [33]:
input.isna().any()

Pclass    False
Age        True
Fare      False
female    False
male      False
dtype: bool

In [34]:
input.columns[input.isna().any()]

Index(['Age'], dtype='object')

In [35]:
input.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [36]:
input.Age = input.Age.fillna(input.Age.mean())
input.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [37]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(input, target, test_size=0.2)

In [38]:
len(X_train), len(X_test)

(712, 179)

In [39]:
len(input)

891

In [40]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [41]:
model.fit(X_train, y_train)

GaussianNB()

In [42]:
model.score(X_test, y_test)

0.7653631284916201

In [43]:
model.predict(X_test[:10])

array([0, 0, 1, 0, 1, 0, 0, 0, 1, 0], dtype=int64)

In [44]:
y_test[:10]

625    0
150    0
767    0
302    0
49     0
525    0
755    1
116    0
345    1
758    0
Name: Survived, dtype: int64

In [47]:
model.predict_proba(X_test[:10])

array([[0.89545795, 0.10454205],
       [0.97869494, 0.02130506],
       [0.05949636, 0.94050364],
       [0.98879675, 0.01120325],
       [0.04971034, 0.95028966],
       [0.99151536, 0.00848464],
       [0.95638265, 0.04361735],
       [0.98218862, 0.01781138],
       [0.02530326, 0.97469674],
       [0.99156178, 0.00843822]])